Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.RenderScene(Autodesk.Revit.DB.View,Autodesk.Revit.DB.DisplayStyle)
Performs rendering of the scene that the server creates.
Remarks:
The representation of geometry is in terms of a set of vertex and index buffers. The server can
use facilities in Autodesk::Revit::DB::DirectContext3D::DrawContext to
create the buffers and fill them with data that encode primitives such as triangles, lines, and points.
The server can also adjust the geometry that it submits based on the argument to RenderScene() and in
response to certain rendering parameters whose values are available through DrawContext (e.g., clip planes).
The final step in the process of submitting geometry for rendering is to call DrawContext::FlushBuffer()
for the appropriate buffers.
This interface method may be called in a separate thread from the others.
dBView:
The view where rendering will occur.
displayStyle:
The display style of the view in which the submitted geometry will be drawn.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.UseInTransparentPass(Autodesk.Revit.DB.View)
Indicates whether this server will submit geometry during the rendering pass for transparent geometry.
Remarks:
Transparent geometry is rendered in a separate pass following the opaque geometry. If a server
returns true from UseInTransparentPass(), it can provide geometry for rendering in either pass using
the RenderScene() method. Otherwise, the server will be called to submit only opaque
geometry.
The server has a way to determine whether it should submit opaque or transparent geometry when
RenderScene() is called
(see Autodesk::Revit::DB::DirectContext3D::DrawContext::IsTransparentPass(void)).
dBView:
The view where rendering will occur.
Returns:
True if the server needs to render transparent geometry, false otherwise.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.GetBoundingBox(Autodesk.Revit.DB.View)
Reports a bounding box of the geometry that this server submits for drawing.
Remarks:
Revit uses the bounding box when navigating views, e.g., when a Zoom to Fit command is issued.
The reported bounding box does not have to be tight. However, there may be unintended side-effects
if the box is inconsistent with the submitted geometry.
dBView:
The view where rendering will occur. If this argument is null, a view-independent bounding box should be reported.
Returns:
The bounding box as an Outline.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.UsesHandles
Tests whether this server uses DirectContext3D handle elements.
Remarks:
In the current release servers that use handle elements can only work with internal addins.
Returns:
True if the server needs to use DirectContext3D handle elements, false otherwise.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.GetSourceId
Reports this server's source ID.
Returns:
The source ID.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.GetApplicationId
Reports this server's application ID.
Returns:
The application ID.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.CanExecute(Autodesk.Revit.DB.View)
Can be used to allow the server to execute only in certain views.
Remarks:
Execution of a DirectContext3D server means that the server is called upon to contribute a bounding box
and graphics content (opaque and transparent) for an opened view. The following are some of the conditions
that control whether the server is executed:
The return value of this interface method.
Whether the server is one of the active servers for the service.
For servers that use DirectContext3D handles, the visibility of handle instances.
dBView:
The view where rendering will occur.
Returns:
True if the server can be executed in the provided view, false otherwise.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer
The interface to be implemented by a server of the DirectContext3D external service.
Since:
2018